Tekla Open API Reference for Tekla Structures 2025
AnalysisCompositeBeam Properties
The AnalysisCompositeBeam type exposes the following members.
Properties
Name | Description
Composite
 Indicates whether the beam is composite.
ConcreteStrength
 The strength of the concrete of the analysis composite beam.
RibDirection
 The direction of the rib of the analysis composite beam (in the global coordinate system).
RibHeight
 The height of the rib of the analysis composite beam.
RibWidth
 The width of the rib of the analysis composite beam.
SlabMaterial
 The slab material of the analysis composite beam.
SlabThickness
 The thickness of the slab of the analysis composite beam.
SlabWidthLeft
 The left width of the slab of the analysis composite beam.
SlabWidthRight
 The right width of the slab of the analysis composite beam.
StudDiameter
 The diameter of the stud of the analysis composite beam.
StudLength
 The length of the stud of the analysis composite beam.
Top
See Also
Reference
AnalysisCompositeBeam Class
Tekla.Structures.Analysis Namespace